Repository: instructure/canvas-ios
Catalog: Student/Widgets/Resources/Localizable.xcstrings
Source language: en
Languages: ar, ca, cy, da, da_instk12, de, es, es_es, fi, fr, fr_ca, ga, hi, ht, id, is, it, ja, mi, ms, nb, nb_instk12, nl, pl, pt, pt_br, ru, sl, sv, sv_instk12, th, vi, zh, zh_hk

source: Selects the course to display total grade for.
ar: لتحديد المساق لعرض الدرجة الإجمالية له.
ca: Selecciona l’assignatura perquè es mostri la nota total per a.
cy: Yn dewis y cwrs er mwyn dangos y radd.
da: Vælger det fag, som den samlede karakter skal vises for.
da_instk12: Vælger det fag, som den samlede vurdering skal vises for.
de: Wählt den Kurs aus, für den die Gesamtnote angezeigt werden soll.
es: Selecciona el curso para mostrar la calificación total.
es_es: Selecciona la asignatura de la cual se mostrará la nota total.
fi: Valitsee kurssi, jonka kokonaisarvosana näytetään.
fr: Permet de sélectionner le cours pour lequel afficher la note totale.
fr_ca: Sélectionne le cours pour lequel la note totale doit être affichée.
ga: Roghnaíonn sé seo an cúrsa a mbeidh an marc iomlán le taispeáint dó.
hi: कुल ग्रेड प्रदर्शित करने के लिए पाठ्यक्रम का चयन करता है।
ht: Seleksyone kou pou yo afiche nòt total pou li a.
id: Memilih kursus untuk menampilkan nilai total.
is: Velur námskeiðið sem á að birta heildareinkunn fyrir.
it: Seleziona il corso per mostrare il voto totale
ja: 総合評定を表示するコースを選択します。
mi: Ka tīpako i te akoranga hei whakaatu i te kōeke katoa.
ms: Memilih kursus untuk memaparkan gred keseluruhan bagi kursus-kursus tersebut.
nb: Velger kurset som samlet vurdering skal vises for.
nb_instk12: Velger faget som samlet vurdering skal vises for.
nl: Selecteert de cursus waarvoor je het totaalcijfer wilt weergeven.
pl: Wybiera kurs, aby wyświetlić dla niego ocenę.
pt: Selecione a disciplina para exibir a nota total.
pt_br: Seleciona o curso para exibir a nota total.
ru: Выбирает курс, для которого будет отображаться общая оценка.
sl: Izbere predmet, za katerega naj se prikaže skupna ocena.
sv: Välj den kurs för vilken du vill visa totalt omdöme för.
sv_instk12: Välj den kurs för vilken du vill visa totalt bedömning för.
th: เลือกบทเรียนที่จะแสดงเกรดรวม
vi: Chọn khóa học để hiển thị tổng điểm.
zh: 选择课程以显示总评分。
zh_hk: 選擇要顯示總評分的課程。

source: Single Grade
ar: درجة واحدة
ca: Nota única
cy: Gradd Unigol
da: Enkelt karakter
da_instk12: Enkelt vurdering
de: Einzelne Note
es: Calificación única
es_es: Nota única
fi: Yksittäinen arvosana
fr: Note unique
fr_ca: Grade unique
ga: Marc Aonair
hi: एकल ग्रेड
ht: Nòt Senp
id: Nilai Tunggal
is: Ein einkunn
it: Voto singolo
ja: 単一評定
mi: Kōeke Kotahi
ms: Gred Tunggal
nb: Enkeltvurdering
nb_instk12: Enkeltvurdering
nl: Enkel cijfer
pl: Jedna ocena
pt: Nota única
pt_br: Nota única
ru: Одиночная оценка
sl: Enojna ocena
sv: Enskilt omdöme
sv_instk12: Enskild bedömning
th: เกรดแยกเดี่ยว
vi: Điểm Một Môn
zh: 单个评分
zh_hk: 單一評分

source: Something Went Wrong!
ar: وقع خطأ ما!
ca: S’ha produït un error
cy: Aeth rhywbeth o’i le!
da: Noget gik galt!
da_instk12: Noget gik galt!
de: Etwas ist schief gelaufen!
es: ¡Algo salió mal!
es_es: ¡Se ha producido un error!
fi: Jotakin meni pieleen!
fr: Une erreur est survenue !
fr_ca: Quelque chose n’a pas fonctionné!
ga: Chuaigh rud éigin mícheart!
hi: कुछ गलत हो गया!
ht: Gen yon Bagay ki Mal Fèt!
id: Ada Sesuatu yang Salah!
is: Eitthvað fór úrskeiðis!
it: Qualcosa è andato storto!
ja: なにか問題が発生しました！
mi: I raru tētahi mea!
ms: Sesuatu Tidak Kena!
nb: Noe gikk galt!
nb_instk12: Noe gikk galt!
nl: Er is iets misgegaan!
pl: Coś poszło nie tak!
pt: Algo correu mal!
pt_br: Algo deu errado!
ru: Что-то пошло не так!
sl: Prišlo je do težav!
sv: Något gick fel!
sv_instk12: Något gick fel!
th: มีบางอย่างผิดปกติ!
vi: Đã Xảy Ra Vấn Đề!
zh: 出现错误！
zh_hk: 發生問題！

source: Space and Stars
ar: الفضاء والنجوم
ca: Espai i estels
cy: Y Gofod a’r Sêr
da: Rummet og stjernerne
da_instk12: Rummet og stjernerne
de: Weltraum und Sterne
es: El espacio y las estrellas
es_es: Espacio y estrellas
fi: Tilat ja tähdet
fr: L’espace et les étoiles
fr_ca: Espace et étoiles
ga: Spás agus Réaltaí
hi: अंतरिक्ष और तारे
ht: Espas ak Etwal
id: Antariksa dan Bintang
is: Geimur og stjörnur
it: Spazio e stelle
ja: 宇宙と星
mi: Mokowhiti me nga Whetu
ms: Angkasa dan Bintang
nb: Rom og stjerner
nb_instk12: Rom og stjerner
nl: Ruimte en sterren
pl: Kosmos i gwiazdy
pt: Espaço e estrelas
pt_br: Espaço e estrelas
ru: Вселенная и звезды
sl: Vesolje in zvezde
sv: Rymden och stjärnorna
sv_instk12: Rymden och stjärnorna
th: อวกาศและดวงดาว
vi: Không Gian và Các Vì Sao
zh: 太空和星球
zh_hk: 太空與星星

source: To see your grades, please log in to your account in the app.
ar: لتر درجاتك، يُرجى تسجيل الدخول في حسابك في التطبيق.
ca: Per consultar les notes, inicieu la sessió al compte a l’aplicació.
cy: I weld eich graddau, mewngofnodwch i’ch cyfrif ar yr ap.
da: For at se dine karakterer skal du logge ind på din konto i appen.
da_instk12: For at se dine vurderinger skal du logge ind på din konto i appen.
de: Um Ihre Noten zu sehen, melden Sie sich bitte in der App bei Ihrem Konto an.
es: Para ver sus calificaciones, inicie sesión en su cuenta en la aplicación.
es_es: Para ver tus notas, inicia sesión en tu cuenta desde la aplicación.
fi: Nähdäksesi arvosanasi, kirjaudu tilillesi sovelluksessa..
fr: Pour afficher vos notes, veuillez vous connecter à votre compte dans l’application.
fr_ca: Pour voir vos notes, veuillez vous connecter à votre compte dans l’application.
ga: Chun do mharcanna a fheiceáil, logáil isteach i do chuntas san aip le do thoil.
hi: अपने ग्रेड देखने के लिए कृपया ऐप में अपने खाते में लॉग इन करें।
ht: Pou w wè nòt ou yo, tanpri konekte sou kont ou nan aplikasyon an.
id: Untuk melihat nilai Anda, silakan login ke akun Anda di aplikasi.
is: Skráðu þig inn á reikninginn þinn í appinu til að sjá einkunnirnar þínar.
it: Per vedere i voti, accedi al tuo account nell’app.
ja: 評定を表示するには、アプリでアカウントにログインしてください。
mi: Hei kite i o tohu, tena koa takiuru ki to putea i roto i te taupānga.
ms: Untuk melihat gred anda, sila log masuk ke akaun anda di aplikasi.
nb: For å se vurderinger, logg inn på kontoen din i appen.
nb_instk12: For å se vurderinger, logg inn på kontoen din i appen.
nl: Meld je in de app aan bij je account om je cijfers te bekijken.
pl: Aby wyświetlić oceny, zaloguj się do konta w aplikacji.
pt: Para ver as suas notas, inicie sessão na sua conta na app.
pt_br: Para ver suas notas, faça login em sua conta no aplicativo.
ru: Чтобы увидеть свои оценки, войдите в свою учетную запись в приложении.
sl: Če si želite ogledati svoje ocene, se prijavite v svoj račun v aplikaciji.
sv: Om du vill se dina att omdömen loggar du in på ditt konto i appen.
sv_instk12: Om du vill se dina bedömningar loggar du in på ditt konto i appen.
th: ดูรเกรดของคุณโดยล็อกอินไปยังบัญชีของคุณในแอพ
vi: Để xem điểm của bạn, vui lòng đăng nhập vào tài khoản của bạn trong ứng dụng.
zh: 要查看您的年级，请在应用程序中登录您的帐户。
zh_hk: 要查看您的成績，請在應用程式中登入您的帳戶。

source: To see your grades, please log in to your account in the app. It'll just take a sec!
ar: لتر درجاتك، يُرجى تسجيل الدخول في حسابك في التطبيق. سيستغرق الأمر ثانية فحسب!
ca: Per consultar les notes, inicieu la sessió al compte a l’aplicació. Només serà un segon!
cy: I weld eich graddau, mewngofnodwch i’ch cyfrif ar yr ap. Fyddwch chi ddim chwinciad!
da: For at se dine karakterer skal du logge ind på din konto i appen. Det tager kun et øjeblik!
da_instk12: For at se dine vurderinger skal du logge ind på din konto i appen. Det tager kun et øjeblik!
de: Um Ihre Noten zu sehen, melden Sie sich bitte in der App bei Ihrem Konto an. Es dauert nur eine Sekunde!
es: Para ver sus calificaciones, inicie sesión en su cuenta en la aplicación. ¡Será rápido!
es_es: Para ver tus notas, inicia sesión en tu cuenta desde la aplicación. ¡Solo te llevará un segundo!
fi: Nähdäksesi arvosanasi, kirjaudu tilillesi sovelluksessa.. Se vie vain hetken!
fr: Pour afficher vos notes, veuillez vous connecter à votre compte dans l’application. Cela ne prendra que quelques secondes !
fr_ca: Pour voir vos notes, veuillez vous connecter à votre compte dans l'application. Cela ne prendra qu’une seconde!
ga: Chun do mharcanna a fheiceáil, logáil isteach i do chuntas san aip le do thoil. Tógfaidh sé nóiméad beag!
hi: अपने ग्रेड देखने के लिए कृपया ऐप में अपने खाते में लॉग इन करें। इसमें बस एक सेकंड का समय लगेगा!
ht: Pou w wè nòt ou yo, tanpri konekte sou kont ou nan aplikasyon an. L ap pran yon segonn!
id: Untuk melihat nilai Anda, silakan login ke akun Anda di aplikasi. Hanya butuh waktu sebentar!
is: Skráðu þig inn á reikninginn þinn í appinu til að sjá einkunnirnar þínar. Það tekur stutta stund!
it: Per vedere i voti, accedi al tuo account nell’app. Ci vorrà un attimo!
ja: 評定を表示するには、アプリでアカウントにログインしてください。すぐに完了します！
mi: Hei kite i o tohu, tena koa takiuru ki to putea i roto i te taupānga. He wa poto noa iho!
ms: Untuk melihat gred anda, sila log masuk ke akaun anda di aplikasi. Hanya mengambil masa beberapa saat!
nb: For å se vurderinger, logg inn på kontoen din i appen. Det tar bare et øyeblikk!
nb_instk12: For å se vurderinger, logg inn på kontoen din i appen. Det tar bare et øyeblikk!
nl: Meld je in de app aan bij je account om je cijfers te bekijken. Het kost je maar een momentje!
pl: Aby wyświetlić oceny, zaloguj się do konta w aplikacji. To potrwa tylko chwilę!
pt: Para ver as suas notas, inicie sessão na sua conta na app. É só um segundo!
pt_br: Para ver suas notas, faça login em sua conta no aplicativo. Só vai demorar um segundo!
ru: Чтобы увидеть свои оценки, войдите в свою учетную запись в приложении. Это займет всего секунду!
sl: Če si želite ogledati svoje ocene, se prijavite v svoj račun v aplikaciji. Trajalo bo le sekundo!
sv: Om du vill se dina att omdömen loggar du in på ditt konto i appen. Det tar bara en sekund!
sv_instk12: Om du vill se dina bedömningar loggar du in på ditt konto i appen. Det tar bara en sekund!
th: ดูรเกรดของคุณโดยล็อกอินไปยังบัญชีของคุณในแอพ แป๊ปเดียวเท่านั้น!
vi: Để xem điểm của bạn, vui lòng đăng nhập vào tài khoản của bạn trong ứng dụng. Sẽ chỉ mất một lát thôi!
zh: 要查看您的年级，请在应用程序中登录您的帐户。只需片刻！
zh_hk: 要查看您的成績，請在應用程式中登入您的帳戶。只需一秒鐘！

source: To see your to-dos, please log in to your account in the app. It'll just take a sec!
ar: لتر قائمة مهامك، يُرجى تسجيل الدخول في حسابك في التطبيق. سيستغرق الأمر ثانية فحسب!
ca: Per consultar les tasques pendents, inicieu la sessió al compte a l’aplicació. Només serà un segon!
cy: I weld eich pethau i’w gwneud, mewngofnodwch i’ch cyfrif ar yr ap. Fyddwch chi ddim chwinciad!
da: For at se din opgaveliste skal du logge ind på din konto i appen. Det tager kun et øjeblik!
da_instk12: For at se din opgaveliste skal du logge ind på din konto i appen. Det tager kun et øjeblik!
de: Um Ihre Aufgaben zu sehen, melden Sie sich bitte in der App bei Ihrem Konto an. Es dauert nur eine Sekunde!
es: Para ver sus tareas por hacer, inicie sesión en su cuenta en la aplicación. ¡Será rápido!
es_es: Para ver tus tareas pendientes, inicia sesión en tu cuenta desde la aplicación. ¡Solo te llevará un segundo!
fi: Nähdäksesi tehtävälistasi, kirjaudu tilillesi sovelluksessa. Se vie vain hetken!
fr: Pour afficher votre liste de choses à faire, veuillez vous connecter à votre compte dans l’application. Cela ne prendra que quelques secondes !
fr_ca: Pour voir vos travaux à accomplir, connectez-vous à votre compte dans l’application. Cela ne prendra qu’une seconde!
ga: Chun do liosta le déanamh a fheiceáil, logáil isteach i do chuntas san aip le do thoil. Tógfaidh sé nóiméad beag!
hi: अपने कार्य देखने के लिए कृपया ऐप में अपने खाते में लॉग इन करें। इसमें बस एक सेकंड का समय लगेगा!
ht: Pou w wè sa w gen pou w fè yo, tanpri konekte sou kont ou nan aplikasyon an. L ap pran yon segonn!
id: Untuk melihat to-do Anda, silakan login ke akun Anda di aplikasi. Hanya butuh waktu sebentar!
is: Skráðu þig inn á reikninginn þinn í appinu til að sjá verkefnalistana þína. Það tekur stutta stund!
it: Per vedere la attività da fare, accedi al tuo account nell’app. Ci vorrà un attimo!
ja: するべきことを表示するには、アプリでアカウントにログインしてください。 すぐに完了します！
mi: Hei kite i o mahi, tena koa takiuru ki to putea i roto i te taupānga. He wa poto noa iho!
ms: Untuk melihat item untuk dilakukan anda, sila log masuk ke akaun anda dalam aplikasi. Hanya mengambil masa beberapa saat!
nb: For å se gjøremålene dine, logg inn på kontoen din i appen. Det tar bare et øyeblikk!
nb_instk12: For å se gjøremålene dine, logg inn på kontoen din i appen. Det tar bare et øyeblikk!
nl: Meld je in de app aan bij je account om je lijst met opdrachten te bekijken. Het kost je maar een momentje!
pl: Aby wyświetlić listy zadań, zaloguj się do konta w aplikacji. To potrwa tylko chwilę!
pt: Para ver as suas tarefas, inicie sessão na sua conta na app. É só um segundo!
pt_br: Para ver suas tarefas, faça login em sua conta no aplicativo. Só vai demorar um segundo!
ru: Чтобы увидеть свои задачи, войдите в свою учетную запись в приложении. Это займет всего секунду!
sl: Če si želite ogledati svoja opravila, se prijavite v svoj račun v aplikaciji. Trajalo bo le sekundo!
sv: Om du vill se dina att göra-uppgifter loggar du in på ditt konto i appen. Det tar bara en sekund!
sv_instk12: Om du vill se dina att göra-uppgifter loggar du in på ditt konto i appen. Det tar bara en sekund!
th: ดูรายการที่ต้องดำเนินการโดยล็อกอินไปยังบัญชีของคุณในแอพ แป๊ปเดียวเท่านั้น!
vi: Để xem các việc cần làm của bạn, vui lòng đăng nhập vào tài khoản của bạn trong ứng dụng. Sẽ chỉ mất một lát thôi!
zh: 要查看任务，请在应用程序中登录您的帐户。 只需片刻！
zh_hk: 若要查看您的待辦事項，請在應用程式中登入您的帳戶。 只需一秒鐘！

source: To-do
ar: ما يجب القيام به
ca: Tasques pendents
cy: I’w Gwneud
da: At gøre
da_instk12: At gøre
de: Aufgaben
es: Tareas por hacer
es_es: Tareas pendientes
fi: Tehtävälista
fr: À faire
fr_ca: À faire
ga: Le Déanamh
hi: करने के लिए
ht: Pou fè
is: Verkefnalisti
it: Attività da fare
ja: するべきこと
mi: Mahi-mahi
ms: Untuk Dilakukan
nb: Gjøremål
nb_instk12: Gjøremål
nl: Opdracht
pl: Do zrobienia
pt: Tarefa
pt_br: A fazer
ru: Для выполнения
sl: Seznam opravil
sv: Att göra
sv_instk12: Att göra
th: สิ่งที่ต้องทำ
vi: Việc cần làm
zh: 待办
zh_hk: 代辦

source: To-Do
ar: ما يجب القيام به
ca: Tasques pendents
cy: Pethau i’w gwneud
da: At gøre
da_instk12: At gøre
es: Para hacer
es_es: Tareas pendientes
fi: Tehtävät
fr: À faire
fr_ca: À faire
ga: Le Déanamh
hi: करने के लिए
ht: Pou Fè
id: Harus Dilakukan
is: Verkefnalisti
it: Da fare
ja: するべきこと
mi: Hei Mahi
ms: Untuk Dilakukan
nb: Gjøremål
nb_instk12: Gjøremål
nl: Te doen
pl: Do zrobienia
pt: A Fazer
pt_br: Lista de tarefas
ru: Для выполнения
sl: Seznam opravil
sv: Att-göra
sv_instk12: Att-göra
th: สิ่งที่ต้องทำ
vi: Cần Làm
zh: 待办
zh_hk: 待辦事項

source: Today,
ar: اليوم،
ca: Avui,
cy: Heddiw,
da: I dag,
da_instk12: I dag,
de: Heute,
es: Hoy,
es_es: Hoy,
fi: Tänään,
fr: Aujourd’hui,
fr_ca: Aujourd’hui
ga: Inniu,
hi: आज
ht: Jodi a,
id: Hari Ini,
is: Í dag,
it: Oggi,
ja: 今日、
mi: I tenei ra,
ms: Hari ini,
nb: I dag,
nb_instk12: I dag,
nl: Vandaag,
pl: Dzisiaj
pt: Hoje
pt_br: Hoje,
ru: Сегодня,
sl: Danes,
sv: Idag.
sv_instk12: Idag.
th: วันนี้
vi: Hôm nay,
zh: 今日，
zh_hk: 今天，

source: View Full List
ar: عرض القائمة الكاملة
ca: Mostreu la llista completa
cy: Gweld y Rhestr Lawn
da: Se hele listen
da_instk12: Se hele listen
de: Vollständige Liste ansehen
es: Ver toda la lista
es_es: Ver la lista completa
fi: Näytä koko listaus
fr: Afficher la liste complète
fr_ca: Voir la liste complète
ga: Féach an Liosta Iomlán
hi: पूरी सूची देखें
ht: Gade Lis Konplè
id: Lihat Daftar Lengkap
is: Skoða heildarlista
it: Visualizza elenco completo
ja: 全リストを表示する
mi: Tirohia te Rarangi Katoa
ms: Lihat Senarai Penuh
nb: Vis fullstendig liste
nb_instk12: Vis fullstendig liste
nl: Volledige lijst bekijken
pl: Wyświetl całą listę
pt: Ver lista completa
pt_br: Ver lista completa
ru: Показать полный список
sl: Prikaži celoten seznam
sv: Visa fullständig lista
sv_instk12: Visa fullständig lista
th: ดูรายการเต็ม
vi: Xem Danh Sách Đầy Đủ
zh: 查看完整列表
zh_hk: 檢視完整淸單

source: View the grade of a selected course.
ar: عرض الدرجة لمساق محدد.
ca: Consulteu la nota d’una assignatura seleccionada.
cy: Gweld y radd ar gyfer cwrs penodol.
da: Se karakteren for et valgt fag.
da_instk12: Se vurderingen for et valgt fag.
de: Zeigt die Benotung eines ausgewählten Kurses an.
es: Ver la calificación de un curso seleccionado.
es_es: Consulta la nota de una asignatura seleccionada.
fi: Katso valitun kurssin arvosana.
fr: Affichez la note d’un cours sélectionné.
fr_ca: Consulter la note d’un cours sélectionné.
ga: Féach ar mharc an chúrsa roghnaithe.
hi: चयनित पाठ्यक्रम का ग्रेड देखें।
ht: Afiche nòt pou yon kou seleksyone.
id: Lihat nilai dari kursus yang dipilih.
is: Skoða einkunn valins námskeiðs.
it: Vedi il voto di un corso selezionato
ja: 選択したコースの評定を表示します。
mi: Tirohia te māka o te akoranga kua tohua.
ms: Lihat gred untuk kursus yang dipilih.
nb: Vis vurderingen for et valgt emne
nb_instk12: Vis vurderingen for et valgt fag
nl: Bekijk het cijfer van een geselecteerde cursus.
pl: Wyświetl ocenę z wybranego kursu.
pt: Veja a nota de uma disciplina selecionada.
pt_br: Veja a nota de um curso selecionado.
ru: Просмотр оценки по выбранному курсу.
sl: Oglejte si oceno izbranega predmeta.
sv: Visa omdömet för en vald kurs.
sv_instk12: Visa bedömningen för en vald kurs.
th: ดูเกรดสำหรับบทเรียนที่เลือก
vi: Xem điểm của khóa học đã chọn.
zh: 查看所选课程的评分。
zh_hk: 檢視所選課程的評分。

source: View the grades of your favourite courses.
ar: عرض الدرجة لمساقاتك المفضلة.
ca: Consulteu les notes de les vostres assignatures preferides.
cy: Gweld y graddau ar gyfer eich hoff gyrsiau.
da: Se karaktererne for dine yndlingsfag.
da_instk12: Se vurderingerne for dine yndlingsfag.
de: Sehen Sie sich die Benotung Ihrer Lieblingskurse an.
es: Ver las calificaciones de sus cursos favoritos.
es_es: Consulta las notas de tus asignaturas favoritas.
fi: Katso suosikkikurssiesi arvosanat.
fr: Affichez les notes de vos cours favoris.
fr_ca: Consultez les notes de vos cours préférés.
ga: Féach ar mharcanna do na gcúrsaí is fearr leat.
hi: अपने पसंदीदा पाठ्यक्रमों के ग्रेड देखें।
ht: Afiche nòt yo pou kou favori ou yo.
id: Lihat nilai dari kursus favorit Anda.
is: Skoðaðu einkunnir uppáhaldsnámskeiðanna þinna.
it: Vedi i voti dei tuoi corsi preferiti.
ja: お気に入りのコースの評定を表示します。
mi: Tirohia nga tohu o o akoranga tino pai.
ms: Lihat gred untuk kursus kegemaran anda.
nb: Vis vurderingene for favorittemnene dine.
nb_instk12: Vis vurderingene for favorittfagene dine.
nl: Bekijk de cijfers van je favoriete cursussen.
pl: Wyświetl oceny z ulubionych kursów.
pt: Veja as notas dos suas disciplinas favoritas.
pt_br: Veja as notas de seus cursos favoritos.
ru: Просмотр оценки по вашим избранным курсам.
sl: Oglejte si ocene svojih najljubših predmetov.
sv: Visa omdömen för dina favoritkurser.
sv_instk12: Visa bedömningen för dina favoritkurser.
th: ดูเกรดสำหรับบทเรียนโปรดของคุณ
vi: Xem điểm các khóa học yêu thích của bạn.
zh: 查看您喜爱的课程的评分。
zh_hk: 檢視您最喜歡的課程的成績。

source: View the latest announcements from your courses.
ar: عرض أحدث إعلامات من مساقاتك.
ca: Visualitzeu els últims anuncis de les vostres assignatures.
cy: Gweld y cyhoeddiadau diweddaraf ar gyfer eich cwrs.
da: Se de seneste meddelelser fra dine fag.
da_instk12: Se de seneste meddelelser fra dine fag.
de: Die neuesten Ankündigungen aus Ihren Kursen anzeigen.
es: Vea los últimos anuncios de sus cursos.
es_es: Ver los últimos anuncios de tus asignaturas.
fi: Tarkastele uusimpia ilmoituksia kursseisasi.
fr: Afficher les dernières annonces depuis votre cours.
fr_ca: Consultez les dernières annonces de vos cours.
ga: Féach ar na fógraí is déanaí ó do chúrsaí.
hi: अपने पाठ्यक्रमों की नवीनतम घोषणाएं देखें।
ht: Afiche dènye anons ki gen nan kou w yo.
id: Lihat pengumuman terbaru dari kursus Anda.
is: Skoðaðu nýjustu tilkynningarnar úr námskeiðum þínum.
it: Visualizza gli annunci più recenti relativi ai tuoi corsi.
ja: コースの最新のアナウンスを表示します。
mi: Titiro ki ngā pānuitanga ina noa nei mai i ō akoranga.
ms: Lihat pengumuman terkini daripada kursus anda.
nb: Vis de siste kunngjøringene fra emnene dine.
nb_instk12: Vis de siste beskjedene fra fagene dine.
nl: Bekijk de laatste aankondigingen van je cursussen.
pl: Wyświetl ostatnie ogłoszenia z kursów.
pt: Veja os últimos anúncios dos seus cursos.
pt_br: Veja os anúncios mais recentes de seus cursos.
ru: Просмотрите последние объявления из своих курсов.
sl: Prikaz najnovejših obvestil za vaše predmete.
sv: Se de senaste meddelandena i dina kurser.
sv_instk12: Se de senaste meddelandena i dina kurser.
th: ดูประกาศล่าสุดจากบทเรียนของคุณ
vi: Xem thông báo chung mới nhất từ khóa học của bạn.
zh: 查看您的课程的最新公告。
zh_hk: 檢視您的課程的最新通告。

source: View the latest grades from assignments and your favorite courses.
ar: عرض أحدث تقديرات من المهام ومن مساقاتك المفضلة.
ca: Visualitzeu les últimes notes de les activitats i les vostres assignatures preferides.
cy: Gweld y graddau diweddaraf o’ch aseiniadau a’ch hoff gyrsiau.
da: Se de seneste karakterer fra opgaver og dine favoritfag.
da_instk12: Se de seneste vurderinger fra opgaver og dine favoritfag.
de: Die letzten Noten für Aufgaben und Ihre bevorzugten Kurse anzeigen.
es: Vea las últimas calificaciones de asignaciones y sus cursos favoritos.
es_es: Ver las últimas notas de actividades y tus asignaturas favoritas.
fi: Näytä uusimmat arvosanat tehtävistä ja suosikkikursseistasi.
fr: Afficher les dernières notes de vos devoirs et vos cours favoris.
fr_ca: Voir les dernières notes issues des travaux et vos cours favoris.
ga: Féach ar na marcanna is déanaí ó thascanna agus na cúrsaí is fearr leat.
hi: असाइनमेंट और अपने पसंदीदा पाठ्यक्रमों से नवीनतम ग्रेड देखें।
ht: Afiche dènye nòt devwa ak kou prefere w yo.
id: Lihat nilai terbaru dari tugas dan kursus favorit Anda.
is: Skoðaðu nýjustu einkunnirnar fyrir verkefni og eftirlætisnámskeiðin þín.
it: Visualizza le votazioni più recenti relative ai tuoi compiti e corsi preferiti.
ja: 課題やお気に入りのコースの最新の評定を表示します。
mi: Titiro ki ngā kōeke ina noa nei mai i ngā whakatunga me ō akoranga makau.
ms: Lihat gred terkini daripada tugasan dan kursus kegemaran anda.
nb: Vis de siste vurderingene fra oppgaver og favorittemnene dine.
nb_instk12: Vis de siste vurderingene fra oppgaver og favorittfagene dine.
nl: Bekijk de laatste cijfers van opdrachten en je favoriete cursussen.
pl: Wyświetl ostatnie oceny z zadań i ulubionych kursów.
pt: Ver as últimas notas dos trabalhos e as suas disciplinas favoritas.
pt_br: Veja as últimas notas das tarefas e seus cursos favoritos.
ru: Просмотрите последние оценки по заданиям и своим любимым курсам.
sl: Prikaz najnovejših ocen za naloge in vaših najljubših predmetov.
sv: Se de senaste omdömena från uppgifter och dina favoritkurser.
sv_instk12: Se de senaste bedömningarna från uppgifter och dina favoritkurser.
th: ดูเกรดล่าสุดจากภารกิจและบทเรียนโปรดของคุณ
vi: Xem điểm mới nhất từ bài tập của bạn và các khóa học ưa thích của bạn.
zh: 查看作业和您收藏的课程的最新评分。
zh_hk: 檢視作業及您的最愛額課程的最新評分。
